app/controllers/lists_controller.rb

	def index
		@list = List.all
---
SELECT "lists".* FROM "lists" WHERE (dostate like 'YES')

	def add
   		@list = List.create(:description => params[:todo_text])
---
INSERT INTO "lists" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "hello"], ["created_at", "2015-04-15 15:43:39.721046"], ["updated_at", "2015-04-15 15:43:39.721046"]]

	def update
 		@list.update(list_params)
---
UPDATE "lists" SET "description" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["description", "do homeworks"], ["updated_at", "2015-04-15 17:11:52.185903"], ["id", 1]]

	def destroy
		if @list.destroy
---
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 3]]

	def finish
		@list.state = true
		@list.save
---
INSERT INTO "lists" ("state", "created_at", "updated_at") VALUES (?, ?, ?)  [["state", "t"], ["created_at", "2015-04-16 03:48:47.563002"], ["updated_at", "2015-04-16 03:48:47.563002"]]
UPDATE "lists" SET "dostate" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["dostate", "YES"], ["updated_at", "2015-04-16 15:38:35.965023"], ["id", 1]]

	def unfinish
		@list.state = false
		@list.save
---
UPDATE "lists" SET "dostate" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["dostate", "NO"], ["updated_at", "2015-04-16 15:38:37.246877"], ["id", 1]]

	def find_list
		@list = List.find(params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 3]]